
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"f747d294b88dcbe169f12a361395e9f8fc6c7e6a4f3d0eee087e4c157728aff7\"" -> "W/\"0174334a790b2bd6acd9b0fd4d02f4256d46fc7d69eaa2756266b0d29156941f\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9ec03922b1f913aa378b2a8337b9f4f920b056a294f8a4c7ec8f655b1dbec2a0\"" -> "W/\"783472656a71d8dd9ed8eb2eebaeda3090cc0193b41859325768a9ab877d6d02\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-docker"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"64dea15ef881552fb59aa53ec0de56fb5258d1d52160a373cbdbeae265166174\"" -> "W/\"b53ffc618f3fd220c8514d3ab11c3ec1b05ec6b027a12ef2cd7b7a4642eae48b\""
        id                          = "kong-docker"
        name                        = "kong-docker"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"aebc6e0d28aba8fcf6767dc31679bbae4fc016fae98dfa10ac70ac26c3282f9c\"" -> "W/\"06f0899833d1ed7bbf6d409b62b4555d20b8563d4e1df4080ef41a3e7085dc29\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"0395a4f70aa516907a79c5911cc67efc84f7b7b03708e2fcf8171031dc078904\"" -> "W/\"2c349f32924d264302535a86e5ad7b10be449b04863102fbe6333562db528741\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"1ab39f6bf835d987ae9043415134fac9e83ae97579717508e4689dbca5b08b85\"" -> "W/\"50effdc7ee4bd3b9499cca528c31d9b07024a0d9baad6e4090994942065c73aa\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"a3beea2952b4c2080b6db90fb741a24f5a09b63a59ab93388940d62bffbfe7c3\"" -> "W/\"dd1ecc54bd6c498a0271fc46b92cf16e792efb0a4882b1d2b7fb2ec15c8ac4fd\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"15cebaf331312f25f05937f8e953eee7acfa297c4502e2a56bf26a1741438fd2\"" -> "W/\"07a263229f5677091c180e46df4374fc36b0ffc7d17b53f3aa55dd1e9297cff8\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_private_all["kong-fuzzy-testing"] has changed
  ~ resource "github_repository" "settings_private_all" {
      ~ etag                        = "W/\"1f55f743ffda1a83eb8c4cf598b95b76f41d6a53b822ed94a77cd118c7a9545b\"" -> "W/\"5d0217431dc8b1fd320fc0146ee36484a6232592e62a4aa14e046b90706fd00b\""
        id                          = "kong-fuzzy-testing"
        name                        = "kong-fuzzy-testing"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_private_all["kong-test-suite"] has changed
  ~ resource "github_repository" "settings_private_all" {
      ~ etag                        = "W/\"0e4915f544873b787e7c60b44a568440102da892ffa037755390cf7b268b7577\"" -> "W/\"fe484161bb55a0b4195c2f89016eb033a3bf4bf766efda7e9f1843672d83b47d\""
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e46d8fe861383ef901219d67fb032bb9887bbfbf32d22cb343c1cd18071c28c7\"" -> "W/\"bd144ef55eb391ef8f9d72fe63b5a112771e6b722a50c78df499e0d686b3d846\""
        id          = "1481994"
        name        = "protect-main-branch-atc-router-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"96ab9abe471bbcf99481b36a0fbf8acf6211310d29744cf7e8b2928cf191efeb\"" -> "W/\"b4af3f60cf0affd9fa4a3c135372808558086e6863502ca3dbe853d65974bb91\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"530955944491a06f352585885405c803c268c3f611b8aeda3d582bfc7d051343\"" -> "W/\"63a66eaa3e4487035737b5550023e32c0e57208c1517a0306d24548f1c98c31a\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"8b5570c77f0c9bed090b04438c6615e49bbe285ea9b2bbfc36b810d7623dbba8\"" -> "W/\"b51c51d36bccf01a22be6ae437deb8bf005e4af669fa7f0c256e24514ede6c09\""
        id          = "1491043"
        name        = "protect-main-branch-kong-docker-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"f664f35e0903f99aeb84e390af353e74e9675e76c61a533516f10d980341450a\"" -> "W/\"7fa9f6b95b69fe1b6e0c657b9d164a202a0d2b00e45521edb597e03264aa021d\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"62265e60252667f7188ac4d0a12fdfa60a675744d50f93a1acd4873db0c41153\"" -> "W/\"d3c369092c1b5e96b24e24c71a8ca48f7c5b59cefdfa977695ef3275cb5fe3d8\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"0816b00b36db4ce7292e9941b7fe72285993975bfed45ace9a44574cfed0ad36\"" -> "W/\"a4335394023ee0730f2042d45ddae23fe536dbe3ded1806e0d192fb8951210a3\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"965828fe4639307b00bf8508de181ae8bdd881cfe9119fb70eb20caf481183cb\"" -> "W/\"bebf18722585ec5c56a4c8fb5fa3fe32621fb0e01af4bf28521aaa9f0e22ad05\""
        id          = "1536655"
        name        = "protect-main-branch-kong-test-suite-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"635a46465b025340c97e08bc156af1b988243bcf1624af458259ac7decd5d89d\"" -> "W/\"beccb73dc662ff3c32658713cf1ea3bc3db74449d55c43acd0cc509958b96290\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"1713c9125b16439e93bca5e63d8d6b14840e2d53c90afaa84d8533cb7653e179\"" -> "W/\"4024ffdfe4bd04f9da6d10240f71247f0ff7509351432834a0cff789eebbee84\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"5e0779f7bf1cc7002c4839e2e8a5c1176eb211a0efbc630232851c23ac981c11\"" -> "W/\"1a60b9cd25b06cf9d40047798d9eb457af427f436de376f857adea6eb6aea97e\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"73f8cffc9e8bfee608db25ad4b41200a9e4e90e284ad463bf96534d7f1d29a3f\"" -> "W/\"fd564e770f3ca386f630322a776c9ce49012d4f143f20d8288ce4bf262869f21\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"58e400651b1514ce1eb1b25cfd4e5b4270146df3a1fccf82cd1628e7fcfeae47\"" -> "W/\"0249b8e9c39cc14ac78f504d452bf0d075c8e4797dc58f34bedec37f1cea258f\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"bb70088dbf78a6196ec5325996d5c47c309efd35c118db865254721e1083af64\"" -> "W/\"9af66d5e7850b1eb9acf140437926d8948744222ac891ac41d2e1e354897fd54\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"f6274da361e2b8729896d924d668efe98ac5990c57a803c60e2e80dc2c71d51e\"" -> "W/\"cb32630a1dd81c0c6115b9c601a80f7e47151c581ca5394d28ab2554c28775a4\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"fda4c64d49adfa093efa5c8926fe4970d4f87ee8b9a56544a62eb1b906f8d5e2\"" -> "W/\"abf055c281312bb820057f1093d69dcca2e90cb4d6f54732c9e172719ea96324\""
        id          = "1491044"
        name        = "protect-main-branch-kong-docker-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"c32cc8f4b19138f414f89f07491d4ee3c1fca1563005ca353a6aa525d63198aa\"" -> "W/\"4b1cfb400721bf1e819973b7fc43e34c4e57d55504cdc6271d30975d2d6fc8f1\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"05694f79da4ba12f8621f5bcb39e5cd1fedde833428100df805adeb0a28edeb9\"" -> "W/\"26dea7978b07c360fc0d8adf8da12b8bff9c49fbc25604e8e2c20209ca3817e8\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"80321bd7637163a51f7e16f8175ab82a7f2127834aa281ce1a70b7fbc382e3fc\"" -> "W/\"ca580dd90d9924449ef3410f9fc06ed0e3ac80cbdd653cb56571e7524ffea8bf\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"7e1152c734e2beb1451f18f120d9b979ca9a9c0f88d5e09a80f2f83a374bd0f4\"" -> "W/\"2dba9eab1cb71aecf92fe44e2b7d09664b1da9cefe1525546fd1043a93466a89\""
        id          = "1536657"
        name        = "protect-main-branch-kong-test-suite-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"99c48c9c4f4fb47009602cd9460f6403e38b9d1ab2e766ae36acc05cc6b8a854\"" -> "W/\"7c590223589cdd25812d3a67366aa9c13cf41d96e29bc3b56df1c58cc977d00b\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"5fab50eccad3448a7f776dca99fb50e3a69872bfff40d27804921c0a12088ffd\"" -> "W/\"0f2082eadd25be046dfe063c09c7a32d68f8f601a3c4e9f66e647d60d83d5326\""
        id          = "1431038"
        name        = "protect-main-branch-template-1-github-release-release-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"d70bcebea09ce5ac9d7ee54db90c7b2b90263818f322d08274d8d4555f9870c5\"" -> "W/\"5f46ad21eea589c0761e65ed0da9e2539a599a8288a7ba43015c01f2b20cb649\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"11a3a8379921715d7672876a665c1db4bd4e76abb4a2ee34076f53c8dc9c3d90\"" -> "W/\"0d09593e9f6fd2cf682925ef0b9700d6e4c82e5269ac39453932bf438882c5cf\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20240829-040838"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1481994"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1491043"
      ~ name        = "protect-main-branch-kong-docker-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-fuzzy-testing"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-fuzzy-testing"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1536655"
      ~ name        = "protect-main-branch-kong-test-suite-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1491044"
      ~ name        = "protect-main-branch-kong-docker-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-fuzzy-testing"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-fuzzy-testing"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1536657"
      ~ name        = "protect-main-branch-kong-test-suite-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1431038"
      ~ name        = "protect-main-branch-template-1-github-release-release-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20240829-040838" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 24 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->